%%%-------------------------------------------------------------------
%%% @author Air-Smile
%%% @copyright (C) 2014, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 28. 五月 2014 14:56
%%%-------------------------------------------------------------------
-module(mylists).
-author("Air-Smile").

%% API
-export([sum/1]).
-export([map/2]).


sum([H | T]) -> H + sum(T); %%[列表的头|列表的尾],如: [1,2,3] H则表示 [1],T则表示 [2,3]
sum([]) -> 0.%%当列表为空的时候 输出 0

map(_,[]) -> []; %% "_"表示可以将任何函数映射到一个空的列表(为空时则是一个空列表),"[]"表示一个列表
map(F , [H|T]) -> [F(H),map(F,T)]. %% "F"表示一个函数表达式,H表示 头 map[F|T] 表示尾

